req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Bye</wsa:Action><wsa:MessageID>urn:uuid:3d4b25f9-baa1-421c-8a4f-c3997e355524</wsa:MessageID><wsd:AppSequence InstanceId="372" SequenceId="urn:uuid:61eda25e-5b2f-4726-aac9-088ab6c635de" MessageNumber="235"></wsd:AppSequence></soap:Header><soap:Body><wsd:Bye><wsa:EndpointReference><wsa:Address>urn:uuid:155bea55-b89d-4b38-a189-d5b046187b37</wsa:Address></wsa:EndpointReference></wsd:Bye></soap:Body></soap:Envelope>